chauphuocvu/LCD-water-control-V1-14_11_2018/STM32F4xx_LCD/Project/FreeRTOS/http_client_server_socket/Embedded_GUI_HAL/src/LcdHal.c
//  GL_DrawLine(Xpos, Ypos, Height, Vertical);
//  GL_DrawLine(Xpos, (Ypos - Width + 1), Height, Vertical);
}

/**
  * @brief  Displays a circle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Radius: the radius size of the circle
  * @retval None
  */
void GL_LCD_DrawCircle(uint8_t Xpos, uint16_t Ypos, uint16_t Radius)
{
	LCD_DrawCircle(Xpos, Ypos, Radius);
//  int32_t  D;/* Decision Variable */
//  uint32_t  CurX;/* Current X Value */
//  uint32_t  CurY;/* Current Y Value */

//  D = 3 - (Radius << 1);
//  CurX = 0;
//  CurY = Radius;

//  while (CurX <= CurY)
//  {
//    LCD_SetCursor(Xpos + CurX, Ypos + CurY);
//    LCD_WriteRAMWord(GL_TextColor);

//    LCD_SetCursor(Xpos + CurX, Ypos - CurY);
//    LCD_WriteRAMWord(GL_TextColor);

//    LCD_SetCursor(Xpos - CurX, Ypos + CurY);
//    LCD_WriteRAMWord(GL_TextColor);

//    LCD_SetCursor(Xpos - CurX, Ypos - CurY);
//    LCD_WriteRAMWord(GL_TextColor);

//    LCD_SetCursor(Xpos + CurY, Ypos + CurX);
//    LCD_WriteRAMWord(GL_TextColor);

//    LCD_SetCursor(Xpos + CurY, Ypos - CurX);
//    LCD_WriteRAMWord(GL_TextColor);

//    LCD_SetCursor(Xpos - CurY, Ypos + CurX);
//    LCD_WriteRAMWord(GL_TextColor);

//    LCD_SetCursor(Xpos - CurY, Ypos - CurX);
//    LCD_WriteRAMWord(GL_TextColor);

//    if (D < 0)
//    {
//      D += (CurX << 2) + 6;
//    }
//    else
//    {
//      D += ((CurX - CurY) << 2) + 10;
//      CurY--;
//    }
//    CurX++;
//  }
}

/**
  * @brief  Displays a bitmap picture
  * @param  BmpAddress: Bmp picture address
  * @retval None
  */
void GL_DrawBMP(uint8_t* ptrBitmap)
{
  uint32_t uDataAddr = 0, uBmpSize = 0;
  uint16_t uBmpData;

  BmpBuffer32BitRead(&uBmpSize, ptrBitmap + 2);
  BmpBuffer32BitRead(&uDataAddr, ptrBitmap + 10);

  /* Set GRAM write direction and BGR = 1 */
  /* I/D=00 (Horizontal : decrement, Vertical : decrement) */
  /* AM=1 (address is updated in vertical writing direction) */
//  LCD_WriteReg(R3, 0x1008);
//  LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */

	LCD_WriteCmd(CMD_SET_ADDR_MODE);
	LCD_WriteRAM(0x88);
	LCD_WriteCmd(CMD_WR_MEMSTART);
	
  /* Read bitmap data and write them to LCD */
  for (; uDataAddr < uBmpSize; uDataAddr += 2)
  {
    uBmpData = (uint16_t)(*(ptrBitmap + uDataAddr)) + (uint16_t)((*(ptrBitmap + uDataAddr + 1)) << 8);
    LCD_WriteRAM( uBmpData );
  }
	
	LCD_WriteCmd(CMD_SET_ADDR_MODE);
	LCD_WriteRAM(0x08);
//  if ( pLcdHwParam.LCD_Connection_Mode == GL_SPI )
//    GL_LCD_CtrlLinesWrite(pLcdHwParam.LCD_Ctrl_Port_NCS, pLcdHwParam.LCD_Ctrl_Pin_NCS, GL_HIGH);

  /* Set GRAM write direction and BGR = 1 */
  /* I/D = 01 (Horizontal : increment, Vertical : decrement) */
  /* AM = 1 (address is updated in vertical writing direction) */
//  LCD_WriteReg(R3, 0x1018);
}

/**
  * @brief  Sets the Font (Big or Small).
  * @param  uFont: specifies the Font (GL_FONT_BIG or GL_FONT_SMALL).
  * @retval None
  */
void GL_SetFont(uint8_t uFont)
{
  GL_Font = uFont;
	
  switch (uFont)
  {
    case GL_FONT_BIG:
      GL_FontWidth  = GL_FONT_BIG_WIDTH;
      GL_FontHeight = GL_FONT_BIG_HEIGHT;
			LCD_SetFont(&LCD_BIG_FONT);
      break;

    case GL_FONT_SMALL:
      GL_FontWidth  = GL_FONT_SMALL_WIDTH;
      GL_FontHeight = GL_FONT_SMALL_HEIGHT;
			LCD_SetFont(&LCD_SMALL_FONT);
      break;

    default:
      break;
  } /* End switch */
}

/**
  * @brief  Switches the backlight either ON or OFF
  * @param  state. This parameter can be one of the following values:
  *     @arg   GL_ON
  *     @arg   GL_OFF
  * @retval None
  */
void GL_BackLightSwitch(uint8_t u8_State)
{
  if (u8_State == GL_OFF)
  { /* Turning OFF the LCD Backlight */
		Off(LCD_BL);
    /* GPIO_ResetBits(LCD_GPIO_DATA_PORT, GPIO_Pin_4); */
//    LCD_DisplayOff();
  }
  else if (u8_State == GL_ON)
  { /* Turning ON the LCD Backlight */
		On(LCD_BL);
    /* GPIO_SetBits(LCD_GPIO_DATA_PORT, GPIO_Pin_4); */
//    LCD_DisplayOn();
  }
}

/**
  * @brief  Initializes the LCD.
  * @param  None
  * @retval None
  */
void GL_LCD_Init(void)
{
    /* Setups the LCD */
	STM324xG_LCD_Init();
//#if defined(USE_STM3210C_EVAL)
//  STM3210C_LCD_Init();  
//#elif defined (USE_STM3210B_EVAL)
//  STM3210B_LCD_Init();
//#elif  defined (USE_STM32100B_EVAL)
//  STM32100B_LCD_Init();
//#elif defined(USE_STM3210E_EVAL)
//  STM3210E_LCD_Init();
//#elif defined(USE_STM32100E_EVAL)
//  STM32100E_LCD_Init();
//#elif defined(USE_STM322xG_EVAL)
//  STM322xG_LCD_Init();
//#elif defined(USE_STM32L152_EVAL)  
//  STM32L152_LCD_Init();
//#endif
}

/**
  * @brief  Disables LCD Window mode.
  * @param  None
  * @retval None
  */
void GL_LCD_WindowModeDisable(void)
{
	LCD_SetArea(0,0,479,271);
//  LCD_SetDisplayWindow(239, 0x13F, 240, 320);
//  LCD_WriteReg(R3, 0x1018);
}

/**
  * @brief  Draw one pixel at position given by Xpos, Ypos of color Color.
  *     Three different modes are specified by PixelSpec in order to save time:
  *     1.FirstPixel, MiddlePixel and LasPixel are used for fastened block-writing
  *       to GRAM (for instance: drawing rectangle, horizontal line etc.)
  *     2.SinglePixel is used for drawing stand-alone pixel. (for instance:
  *       drawing circle, character etc.).
  * @param  Xpos: specifies X position
  * @param  Ypos: specifies Y position
  * @param  Color: RGB color of point
  * @param  PixelSpec: specifies Mode of putting pixel.
  *         This parameter can be one of the following values:
  *     @arg  - FirstPixel:  Starting pixel of block-writing sequence.
  *     @arg  - MiddlePixel: Middle-located pixel of block-writing sequence.
  *     @arg  - LasPixel:    Ending pixel of block-writing sequence
  *     @arg  - SinglePixel: Separated pixel.
  * @retval None
  */
void LCD_PutPixel(uint16_t Xpos, uint16_t Ypos, uint16_t Color, uint8_t PixelSpec)
{
	uint16_t tmpColor = GL_TextColor;
	GL_SetTextColor(Color);
	SSD1963_PutPixel(Xpos, Ypos);
	GL_SetTextColor(tmpColor);
//  /*Start part of put pixel for first pixel of block and for single one.
//  It consists of set the cursor's position and GRAM prepare sequence.*/
//  if ((PixelSpec & (FirstPixel | SinglePixel)) != GL_RESET)
//  {
//    LCD_SetCursor(Xpos, Ypos);
//    LCD_WriteRAM_Prepare();
//  }

