chauphuocvu/LCD-water-control-V1-14_11_2018/STM32F4xx_LCD/Project/FreeRTOS/http_client_server_socket/Embedded_GUI_HAL/src/LcdHal.c
	GL_SetDisplayWindow(Xpos_Init, Ypos_Init,(Xpos_Init + Width - 1),(Ypos_Init + Height - 1));
	
	LCD_WriteCmd(CMD_SET_ADDR_MODE);
	LCD_WriteRAM(0x88);
	LCD_WriteCmd(CMD_WR_MEMSTART);
	
  /* Read bitmap data and write them to LCD */
  for (; uDataAddr < uBmpSize; uDataAddr += 2)
  {
    uBmpData = (uint16_t)(*(ptrBitmap + uDataAddr)) + (uint16_t)((*(ptrBitmap + uDataAddr + 1)) << 8);
    LCD_WriteRAM( uBmpData );
  }
	
	LCD_WriteCmd(CMD_SET_ADDR_MODE);
	LCD_WriteRAM(0x08);
	
//  if (LCD_Direction == _0_degree)
//  {
//    GL_SetDisplayWindow(Xpos_Init, Ypos_Init, Height, Width);
//    /* Set GRAM write direction and BGR = 1 */
//    /* I/D=00 (Horizontal : decrement, Vertical : decrement) */
//    /* AM=1 (address is updated in vertical writing direction) */
//    LCD_WriteReg(R3, 0x1008);
//  }
//  else if (LCD_Direction == _90_degree)
//  {
//    GL_SetDisplayWindow(Xpos_Init + Width - 1, Ypos_Init, Width, Height);
//    /* Set GRAM write direction and BGR = 1 */
//    /* I/D=01 (Horizontal : increment, Vertical : decrement) */
//    /* AM=0 (address is updated in horizontal writing direction) */
//    LCD_WriteReg(R3, 0x1010);
//  }
//  else if (LCD_Direction == _180_degree)
//  {
//    GL_SetDisplayWindow(Xpos_Init + Height - 1, Ypos_Init + Width - 1, Height, Width);
//    /* Set GRAM write direction and BGR = 1 */
//    /* I/D=11 (Horizontal : increment, Vertical : increment) */
//    /* AM=1 (address is updated in vertical writing direction) */
//    LCD_WriteReg(R3, 0x1038);
//  }
//  else if (LCD_Direction == _270_degree)
//  {
//    GL_SetDisplayWindow(Xpos_Init, Ypos_Init + Height - 1, Width, Height);
//    /* Set GRAM write direction and BGR = 1 */
//    /* I/D=10 (Horizontal : decrement, Vertical : increment) */
//    /* AM=0 (address is updated in horizontal writing direction) */
//    LCD_WriteReg(R3, 0x1020);
//  }

//  LCD_SetCursor(Xpos_Init, Ypos_Init);

//  if ((LCDType == LCD_ILI9320) || (LCDType == LCD_SPFD5408))
//  {
//    /* Prepare to write GRAM */
//    LCD_WriteRAM_Prepare(); 
//  }

//  /* Read bitmap data and write them to LCD */
//  for (; uDataAddr < uBmpSize; uDataAddr += 2)
//  {
//    uBmpData = (uint16_t)(*(ptrBitmap + uDataAddr)) + (uint16_t)((*(ptrBitmap + uDataAddr + 1)) << 8);
//    LCD_WriteRAM( uBmpData );
//  }
//  if ((LCDType == LCD_ILI9320) || (LCDType == LCD_SPFD5408))
//  {
//    if ( pLcdHwParam.LCD_Connection_Mode == GL_SPI )
//    {
//      GL_LCD_CtrlLinesWrite(pLcdHwParam.LCD_Ctrl_Port_NCS, pLcdHwParam.LCD_Ctrl_Pin_NCS, GL_HIGH);
//    }
//  }
//  LCD_Change_Direction(LCD_Direction);
//  GL_SetDisplayWindow(LCD_Height - 1, LCD_Width - 1, LCD_Height, LCD_Width);
}

/**
  * @}
  */ 

/**
  * @}
  */ 

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
